function y = proizv(t, yy)
    mu = 3.986004418E+14; % константа гравитационного поля Земли
    Rz = 6378136; % экваториальный радиус Земли
    we = 7.292115E-05; % угловая скорость вращения Земли
    C20 = -1082.62575E-06;
    t_G0 = 4.627456713694580e+04;
    t_G = t_G0 + we*(t- 3*3600);
    % Ускорения, принимаем постоянными на всем интервале расчета
    Ax = .186264514923E-05;
    Ay = .931322574615E-06;
    Az = -.279396772385E-05;

    Jsum_x = Ax*cos(t_G)-Ay*sin(t_G);
    Jsum_y = Ax*sin(t_G)+Ay*cos(t_G);
    Jsum_z = Az;
    
    y = yy(:);
    y(1) = yy(4);
    y(2) = yy(5);
    y(3) = yy(6);
    r = sqrt(yy(1)*yy(1)+yy(2)*yy(2)+yy(3)*yy(3));
    mu_ = mu/(r*r);
    x_ = yy(1)/r;
    y_ = yy(2)/r;
    z_ = yy(3)/r;
    ro = Rz/r;
    y(4) = -mu_*x_ + 3/2*C20*mu_*x_*ro^2*(1-5*z_^2) + Jsum_x;
    y(5) = -mu_*y_ + 3/2*C20*mu_*y_*ro^2*(1-5*z_^2) + Jsum_y;
    y(6) = -mu_*z_ + 3/2*C20*mu_*z_*ro^2*(3-5*z_^2) + Jsum_z;
end